# Напишите программу которая принимает на вход два числа
# и проверяет, является ли одно число квадратом другого
# n = int(input())
# m = int(input())
# if n == m**2 or m == n**2:
#    print('yes')
# else:
#    print('no')

# Напишите программу которая принимает на вход 5 чисел
# и находит максимальное из них

# nam_max = 0
# for i in range(5):
#    nam = int(input())
#    if nam_max < nam:
#        nam_max = nam
# print(nam_max)

# Напишите программу которая на вход будет принимать число N
# и будет выводить числа от -N до N

# num = int(input('Введите число: '))
# print(*range(-num, num + 1))

# Напиши программу, коорая будет принимать на вход дробь 
# и показывать первую цифру дробного числа

# num = float(input('Введите дробное число: '))
# print(int(num * 10 % 10))

# Напишите программу, которая принимает на вход число 
# и проверяет, кратно ли оно 5 и 10 или 15, но не 30

# num = int(input("Input your number: "))
# if(num % 5 == 0 and num % 10 == 0 or num % 15 == 0) and num % 30 != 0:
#    print("Yes")
#else:
#    print('No')

# Пример проверки ложности утверждения (x == z) or (x > (y ^ z))
